Vorlesung/ProPar-FuProFormlttn.org
# +SETUPFILE: /Users/johannes/Documents/myOrg/org-html-themes/setup/theme-bigblow.setup
#+SETUPFILE: ./theme-bigblow-local.setup
#+TITLE: Funktionale Programmierung -- Formalisierung
#+SUBTITLE: Programmierparadigmen
#+AUTHOR: Johannes Brauer
#+OPTIONS:   H:4
#+OPTIONS: num:nil d:nil
#+OPTIONS: toc:nil
#+OPTIONS: reveal_single_file:nil
#+Language:  de
#+STARTUP: latexpreview
#+STARTUP: inlineimages
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="mycss/mystyle.css" />
#+REVEAL_THEME: simple
#+REVEAL_TRANS: slide
#+REVEAL_HLEVEL: 1
# #+REVEAL_SLIDE_FOOTER: Prof. Dr.-Ing. Johannes Brauer: Programmierparadigmen
#+REVEAL_THEME: simple
#+REVEAL_TRANS: slide
#+REVEAL_HLEVEL: 1
#+REVEAL_INIT_SCRIPT: dependencies: [ { src: 'plugin/menu/menu.js', async: true },
#+REVEAL_INIT_SCRIPT:                 { src: 'reveal.js/plugin/zoom-js/zoom.js', async: true } ]
#+REVEAL_MARGIN: 0.05
#+REVEAL_EXTRA_CSS: ./mycss/myrevealstyle.css
#+OPTIONS: reveal_control:t

# um Folien mit reveal.js erzeugen zu können:ml
# M-x load-library und dann ox-reveal


* Syntax und Semantik von Clojure

** (Vereinfachte) Syntax von Clojure /(1)/

#+BEGIN_VERSE
      <def> = (*def* <var> <exp>)
      <exp> =   <var>
              | <con>
              | (<prm> <exp> ... <exp>)
              | (<var> <exp> ... <exp>)
              | (*cond* <exp> <exp> ... <exp> <exp>)
              | (*cond* <exp> <exp> ... *:else* <exp>)
              | (*fn* [<var> <var> ... <var>] <exp>)
#+END_VERSE
-  Clojure-Programme bestehen (bisher) aus Definitionen (=<def>=) und
   Ausdrücken (=<exp>=).
-  Ausdrücke können sein:
   -  Variablen (=<var>=) oder Konstanten (=<con>=)
   -  Funktionsanwendungen (Funktionsaufrufe)
   -  Bedingte Ausdrücke
   -  Funktionen (aka Lambda-Ausdrücke)

** (Vereinfachte) Syntax von Clojure /(2)/

-  Zur Erleichterung der Kommunikation kann es sinnvoll sein,
   syntaktischen Komponenten Namen zu geben:

#+BEGIN_VERSE
     (*cond* <frage> <antwort> ... <frage> <antwort>)

     (*fn*  [<parameter> ... <parameter>] <rumpf>)
#+END_VERSE
-  =cond= erwartet eine beliebige Anzahl von Ausdruckspaaren, deren
   erster Ausdruck eine Bedingung (=frage=) und deren zweiter das
   zugehörige Ergebnis (=antwort=) darstellt.
-  Der auf =fn= folgende Vektor von Variablen heißt der /Kopf/ (header)
   einer Funktionsdefinition und beschreibt die Liste der /formalen
   Parameter/.
-  Dem Kopf folgt ein Ausdruck, der den /Rumpf/ (body) der Funktion
   darstellt.

** Semantik einer Programmiersprache

-  Die Syntax beschreibt den Aufbau grammatikalisch korrekter Sätze.
-  Die Semantik beschreibt die Bedeutung grammatikalisch korrekter
   Sätze.
-  Die Semantik natürlichsprachlicher Sätze wird häufig durch Sätze mit
   einfacheren (bereits bekannten) Begriffen beschrieben.
-  Die Semantik einer Programmiersprache...
   -  legt fest, welche Wirkung jedes Sprachelement oder -konstrukt im
      Programmablauf hervorruft;
   -  wird beschrieben durch
      -  Sätze in natürlicher Sprache (häufig anzutreffen bei gängigen
         Programmiersprachen (z.B. C, Pascal, Java, Smalltalk); Problem:
         Beschreibung umfangreich und nicht eindeutig;
      -  Menge von Verhaltensregeln, die die Funktionsweise von
         Programmen bestimmen; kann formal und damit unzweideutig
         erfolgen.

** (Vereinfachte) Semantik von Clojure /(1)/

-  Es gibt verschiedene Arten, die Semantik einer Programmiersprache
   formal zu beschreiben:
   -  Durch Angabe eines Interpreters für eine bestimmte Maschine;
      beschreibt wie ein Programm ausgeführt wird (operationelle
      Semantik).
   -  Durch Übersetzung in eine andere Sprache, deren Semantik bereits
      definiert ist:
      -  z.B. in mathematischen Objekten (Relationen, Funktionen)
      -  beschreibt, was der Effekt der Ausführung eines Programms ist
         (denotationelle Semantik).
-  Für die Beschreibung der Semantik von Clojure greifen wir auf
   einfache Regeln der Algebra zurück.

** (Vereinfachte) Semantik von Clojure /(2)/

-  Die Semantik definiert, wie Clojure-Ausdrücke ausgewertet werden.
-  Auswertung bedeutet, dass ein Ausdruck durch Anwenden von Regeln
   solange umgeformt wird, bis ein Wert übrig bleibt.
-  Werte sind (bisher):
   -  Zahlen (2, 3.5, 1/3)
   -  boolesche Werte (=true=, =false=)
   -  Symbole (=’Karl=, =’hallo=)
   -  Listen, bestehend aus Zahlen, booleschen Werten, Symbolen und
      Listen
-  Zahlen, boolesche Werte und Symbole sind Ausdrücke, die zu sich
   selbst ausgewertet werden (self evaluating expressions).

** Semantik der Funktionsanwendung

-  Funktionsanwendungen tauchen in der Syntax in zwei Formen auf:
   1. =(<prm> <exp> ... <exp>)=
   2. =(<var> <exp> ... <exp>)=
-  =prm= steht dabei für eine in Clojure eingebaute Funktion
   (Standardfunktion), wie z.B. =+=, =*= usw.
-  =var= steht für eine benutzerdefinierte Funktion, d.h. eine Funktion,
   die mithilfe der Pseudofunktion =def= definiert wurde.
-  Verallgemeinert ausgedrückt, handelt es sich in beiden Fällen um
   Ausdrücke, deren Wert eine Funktion ist.

** Auswertungsregel für Standardfunktionen

1. *Werte alle Ausdrücke der Funktionsanwendung aus*!
2. *Wende die Standardfunktion, die dem Wert des ersten Ausdrucks*
   (=<prm>=) *entspricht, auf die in Schritt 1 ausgewerteten Argumente*
   (=<exp> …=) *an!*

Man beachte die Rekursivität der Auswertungsregel.

** Anwendung von Standardfunktionen -- Beispiel

-  Der Ausdruck

   #+BEGIN_EXAMPLE
       (+ (* (/ 12 8) 2/3) (- 20 (Math/sqrt 4)))
   #+END_EXAMPLE

   soll Schritt für Schritt gemäß der Auswertungsregel für
   Standardfunktionen ausgewertet werden:

   #+BEGIN_EXAMPLE
       (+ (* (/ 12 8) 2/3) (- 20 (Math/sqrt 4))) 
           = (+ (* 3/2 2/3) (- 20 (Math/sqrt 4)))
           = (+ 1 (- 20 (Math/sqrt 4)))
           = (+ 1 (- 20 2.0))
           = (+ 1 18.0)
           = 19.0 
   #+END_EXAMPLE

-  Da die Werte von =+=, =*= usw. Folgen von Maschinenbefehlen
   entsprechen, die die zugehörige Funktion ausführen, bleiben diese bei
   der schrittweisen Auswertung solange stehen, bis sie auf ihre
   Argumente angewendet werden können.

