Vorlesung/ProPar-FuProFormlttn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de" xml:lang="de">
<head>
<!-- 2017-10-10 Tue 21:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Funktionale Programmierung &#x2013; Formalisierung</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Johannes Brauer" />
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="mycss/mystyle.css" />
</head>
<body>
<div id="content">
<h1 class="title">Funktionale Programmierung &#x2013; Formalisierung
<br />
<span class="subtitle">Programmierparadigmen</span>
</h1>


<div id="outline-container-orgbe6f4cc" class="outline-2">
<h2 id="orgbe6f4cc">Syntax und Semantik von Clojure</h2>
<div class="outline-text-2" id="text-orgbe6f4cc">
</div><div id="outline-container-org4e75cdc" class="outline-3">
<h3 id="org4e75cdc">(Vereinfachte) Syntax von Clojure <i>(1)</i></h3>
<div class="outline-text-3" id="text-org4e75cdc">
<p class="verse">
&lt;def&gt; = (<b>def</b> &lt;var&gt; &lt;exp&gt;)<br />
&lt;exp&gt; =   &lt;var&gt;<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;| &lt;con&gt;<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;| (&lt;prm&gt; &lt;exp&gt; &#x2026; &lt;exp&gt;)<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;| (&lt;var&gt; &lt;exp&gt; &#x2026; &lt;exp&gt;)<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;| (<b>cond</b> &lt;exp&gt; &lt;exp&gt; &#x2026; &lt;exp&gt; &lt;exp&gt;)<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;| (<b>cond</b> &lt;exp&gt; &lt;exp&gt; &#x2026; <b>:else</b> &lt;exp&gt;)<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;| (<b>fn</b> [&lt;var&gt; &lt;var&gt; &#x2026; &lt;var&gt;] &lt;exp&gt;)<br />
</p>
<ul class="org-ul">
<li>Clojure-Programme bestehen (bisher) aus Definitionen (<code>&lt;def&gt;</code>) und
Ausdrücken (<code>&lt;exp&gt;</code>).</li>
<li>Ausdrücke können sein:
<ul class="org-ul">
<li>Variablen (<code>&lt;var&gt;</code>) oder Konstanten (<code>&lt;con&gt;</code>)</li>
<li>Funktionsanwendungen (Funktionsaufrufe)</li>
<li>Bedingte Ausdrücke</li>
<li>Funktionen (aka Lambda-Ausdrücke)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgc9c6335" class="outline-3">
<h3 id="orgc9c6335">(Vereinfachte) Syntax von Clojure <i>(2)</i></h3>
<div class="outline-text-3" id="text-orgc9c6335">
<ul class="org-ul">
<li>Zur Erleichterung der Kommunikation kann es sinnvoll sein,
syntaktischen Komponenten Namen zu geben:</li>
</ul>

<p class="verse">
(<b>cond</b> &lt;frage&gt; &lt;antwort&gt; &#x2026; &lt;frage&gt; &lt;antwort&gt;)<br />
<br />
(<b>fn</b>  [&lt;parameter&gt; &#x2026; &lt;parameter&gt;] &lt;rumpf&gt;)<br />
</p>
<ul class="org-ul">
<li><code>cond</code> erwartet eine beliebige Anzahl von Ausdruckspaaren, deren
erster Ausdruck eine Bedingung (<code>frage</code>) und deren zweiter das
zugehörige Ergebnis (<code>antwort</code>) darstellt.</li>
<li>Der auf <code>fn</code> folgende Vektor von Variablen heißt der <i>Kopf</i> (header)
einer Funktionsdefinition und beschreibt die Liste der <i>formalen
Parameter</i>.</li>
<li>Dem Kopf folgt ein Ausdruck, der den <i>Rumpf</i> (body) der Funktion
darstellt.</li>
</ul>
</div>
</div>

<div id="outline-container-org0f80a37" class="outline-3">
<h3 id="org0f80a37">Semantik einer Programmiersprache</h3>
<div class="outline-text-3" id="text-org0f80a37">
<ul class="org-ul">
<li>Die Syntax beschreibt den Aufbau grammatikalisch korrekter Sätze.</li>
<li>Die Semantik beschreibt die Bedeutung grammatikalisch korrekter
Sätze.</li>
<li>Die Semantik natürlichsprachlicher Sätze wird häufig durch Sätze mit
einfacheren (bereits bekannten) Begriffen beschrieben.</li>
<li>Die Semantik einer Programmiersprache&#x2026;
<ul class="org-ul">
<li>legt fest, welche Wirkung jedes Sprachelement oder -konstrukt im
Programmablauf hervorruft;</li>
<li>wird beschrieben durch
<ul class="org-ul">
<li>Sätze in natürlicher Sprache (häufig anzutreffen bei gängigen
Programmiersprachen (z.B. C, Pascal, Java, Smalltalk); Problem:
Beschreibung umfangreich und nicht eindeutig;</li>
<li>Menge von Verhaltensregeln, die die Funktionsweise von
Programmen bestimmen; kann formal und damit unzweideutig
erfolgen.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgd10f95a" class="outline-3">
<h3 id="orgd10f95a">(Vereinfachte) Semantik von Clojure <i>(1)</i></h3>
<div class="outline-text-3" id="text-orgd10f95a">
<ul class="org-ul">
<li>Es gibt verschiedene Arten, die Semantik einer Programmiersprache
formal zu beschreiben:
<ul class="org-ul">
<li>Durch Angabe eines Interpreters für eine bestimmte Maschine;
beschreibt wie ein Programm ausgeführt wird (operationelle
Semantik).</li>
<li>Durch Übersetzung in eine andere Sprache, deren Semantik bereits
definiert ist:
<ul class="org-ul">
<li>z.B. in mathematischen Objekten (Relationen, Funktionen)</li>
<li>beschreibt, was der Effekt der Ausführung eines Programms ist
(denotationelle Semantik).</li>
</ul></li>
</ul></li>
<li>Für die Beschreibung der Semantik von Clojure greifen wir auf
einfache Regeln der Algebra zurück.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf0b8770" class="outline-3">
<h3 id="orgf0b8770">(Vereinfachte) Semantik von Clojure <i>(2)</i></h3>
<div class="outline-text-3" id="text-orgf0b8770">
<ul class="org-ul">
<li>Die Semantik definiert, wie Clojure-Ausdrücke ausgewertet werden.</li>
<li>Auswertung bedeutet, dass ein Ausdruck durch Anwenden von Regeln
solange umgeformt wird, bis ein Wert übrig bleibt.</li>
<li>Werte sind (bisher):
<ul class="org-ul">
<li>Zahlen (2, 3.5, 1/3)</li>
<li>boolesche Werte (<code>true</code>, <code>false</code>)</li>
<li>Symbole (<code>’Karl</code>, <code>’hallo</code>)</li>
<li>Listen, bestehend aus Zahlen, booleschen Werten, Symbolen und
Listen</li>
</ul></li>
<li>Zahlen, boolesche Werte und Symbole sind Ausdrücke, die zu sich
selbst ausgewertet werden (self evaluating expressions).</li>
</ul>
</div>
</div>

<div id="outline-container-orgb8a3568" class="outline-3">
<h3 id="orgb8a3568">Semantik der Funktionsanwendung</h3>
<div class="outline-text-3" id="text-orgb8a3568">
<ul class="org-ul">
<li>Funktionsanwendungen tauchen in der Syntax in zwei Formen auf:
<ol class="org-ol">
<li><code>(&lt;prm&gt; &lt;exp&gt; ... &lt;exp&gt;)</code></li>
<li><code>(&lt;var&gt; &lt;exp&gt; ... &lt;exp&gt;)</code></li>
</ol></li>
<li><code>prm</code> steht dabei für eine in Clojure eingebaute Funktion
(Standardfunktion), wie z.B. <code>+</code>, <code>*</code> usw.</li>
<li><code>var</code> steht für eine benutzerdefinierte Funktion, d.h. eine Funktion,
die mithilfe der Pseudofunktion <code>def</code> definiert wurde.</li>
<li>Verallgemeinert ausgedrückt, handelt es sich in beiden Fällen um
Ausdrücke, deren Wert eine Funktion ist.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbdc925e" class="outline-3">
<h3 id="orgbdc925e">Auswertungsregel für Standardfunktionen</h3>
<div class="outline-text-3" id="text-orgbdc925e">
<ol class="org-ol">
<li><b>Werte alle Ausdrücke der Funktionsanwendung aus</b>!</li>
<li><b>Wende die Standardfunktion, die dem Wert des ersten Ausdrucks</b>
(<code>&lt;prm&gt;</code>) <b>entspricht, auf die in Schritt 1 ausgewerteten Argumente</b>
(<code>&lt;exp&gt; …</code>) <b>an!</b></li>
</ol>

<p>
Man beachte die Rekursivität der Auswertungsregel.
</p>
</div>
</div>

<div id="outline-container-org658bcf4" class="outline-3">
<h3 id="org658bcf4">Anwendung von Standardfunktionen &#x2013; Beispiel</h3>
<div class="outline-text-3" id="text-org658bcf4">
<ul class="org-ul">
<li><p>
Der Ausdruck
</p>

<pre class="example">
       (+ (* (/ 12 8) 2/3) (- 20 (Math/sqrt 4)))
</pre>

<p>
soll Schritt für Schritt gemäß der Auswertungsregel für
Standardfunktionen ausgewertet werden:
</p>

<pre class="example">
       (+ (* (/ 12 8) 2/3) (- 20 (Math/sqrt 4))) 
           = (+ (* 3/2 2/3) (- 20 (Math/sqrt 4)))
           = (+ 1 (- 20 (Math/sqrt 4)))
           = (+ 1 (- 20 2.0))
           = (+ 1 18.0)
           = 19.0 
</pre></li>

<li>Da die Werte von <code>+</code>, <code>*</code> usw. Folgen von Maschinenbefehlen
entsprechen, die die zugehörige Funktion ausführen, bleiben diese bei
der schrittweisen Auswertung solange stehen, bis sie auf ihre
Argumente angewendet werden können.</li>
</ul>
</div>
</div>
