Vorlesung/ProPar-FuProFormlttn.org
** Die globale Umgebung

-  Man beachte, dass Ausdrücke wie\\
   =(+ x 2)= oder =(f 7 8)=\\
   -- jeweils isoliert betrachtet -- nicht ausgewertet werden können, da
   nicht klar ist, wozu =x= bzw. welche Funktion =f= ausgewertet werden
   soll.
-  Die Auswertung ist nur in einer /Umgebung/ möglich, in der die Werte
   aller Variablen definiert sind.
-  Durch die Pseudofunktion =def= wird einer Variablen ein Wert
   zugeordnet. Diese Assoziation merkt sich der Interpreter in einem
   Gedächtnis, das /globale Umgebung/ genannt wird.

** Auswertungen in der globalen Umgebung

-  In einer Umgebung können nun auch Ausdrücke ausgewertet werden, die
   Variablen enthalten, sofern sich für sie ein Eintrag in der Umgebung
   befindet.
-  Dabei werden Variablen durch die ihnen assoziierten Werte ersetzt.
-  Für den Fall, dass die anzuwendende Funktion eine benutzerdefinierte
   ist (d.h. der Variablen ist ein ~fn~-Ausdruck zugeordnet), erweitern
   wir die Auswertungsregel um das

*Ersetzungsmodell für Funktionsanwendungen:*

-  *Werte den Rumpf der Funktion aus, wobei jeder formale Parameter
   durch das korrespondierende ausgewertete Argument ersetzt wird.*

-  Formal: Mit =(def f (fn= $[x_{1} \ldots x_{n}]$ =exp))= gilt:
   $(f v_{1} \ldots v_{n}) = exp^{x_{i}}_{v_{i}}$. Dabei bedeutet
   $exp^{x_{i}}_{v_{i}}$, dass in =exp= jedes Auftreten eines $x_{i}$ in
   durch $v_{i}$ ersetzt ist.

** Anwendung des Ersetzungsmodells

-  Gegeben seien die beiden folgenden Funktionsdefinitionen:
#+begin_small
   #+BEGIN_SRC clojure
       (def summe-der-quadrate
             (fn [x y] 
               (+ (* x x) (* y y))))
       (def fun
             (fn [a] 
               (summe-der-quadrate (+ a 1) (* a 2)))) 
   #+END_SRC
#+end_small
-  Wenden wir nun das Ersetzungsmodell auf diese Funktionsanwendung an: 

   ~(fun 3)~
 
#+REVEAL: split

#+BEGIN_VERSE 
    (*fun* 3)
        = ((fn [a] (summe-der-quadrate (+ a 1) (* a 2))) 3)
        = *((fn [a] (summe-der-quadrate (+ a 1) ( * a 2))) 3)*
        = (summe-der-quadrate (+ 3 1) (* 3 2))
        = (summe-der-quadrate *(+ 3 1) ( * 3 2)*)
        = (summe-der-quadrate 4 6)
        = (*summe-der-quadrate* 4 6)
        = ((fn [x y] (+ (* x x) (* y y))) 4 6)
        = *((fn [x y] (+ ( * x x) ( * y y))) 4 6)*
        = (+ (* 4 4) (* 6 6))
        = (+ 16 36)
        = 52
#+END_VERSE

* Auswertungsregeln für Clojure-Pseudofunktionen

** Pseudofunktionen

-  /Pseudofunktionen/ (in der Lisp-Terminologie auch /special forms/
   genannt) heißen so, weil

   -  für sie besondere Auswertungsregeln gelten und/oder

   -  ihre Auswertung keinen Wert liefert.

-  Bisher benutzte Pseudofunktionen:

   -  =def=

   -  =fn=

   -  =cond=

   -  =:else=

** Auswertungsregeln für =def= und =fn=

-  =def= :: Der Ausdruck =(def var exp)= liefert keinen Wert, sondern
   hat lediglich den Effekt, dass der Variablen =var= der Wert von =exp=
   in der globalen Umgebung zugeordnet wird.

-  =fn= :: Der Ausdruck =(fn [v1 … vn] exp)= liefert als Wert eine
   (namenlose/anonyme) Funktion mit den formalen Parametern =v1 … vn=
   und der Berechnungsvorschrift =exp=.

** Auswertungsregel für =cond= ohne =:else= 
Zwei Fälle sind zu unterscheiden:
1. Die erste Frage (Bedingung) ist =false=:
   #+BEGIN_VERSE 
       (cond
           false $\ldots$
           frage2 antwort2
           $\ldots$)
       = (cond
            frage2 antwort2
            $\ldots$)
   #+END_VERSE
   D.h. die erste Frage-Antwort-Kombination wird eliminiert.

#+REVEAL: split

2. [@2]Die erste Frage (Bedingung) ist =true=:

   #+BEGIN_VERSE 
       (cond
           true exp
           $\ldots$)
       = exp
   #+END_VERSE

   D.h. der Wert des ganzen =cond=-Ausdrucks ist =exp=.

Wenn keine Frage =true= liefert, ist das Resultat =nil=.

** Auswertungsregel für =cond= mit =:else=

-  Die Auswertung erfolgt wie bei =cond= ohne =:else=. Wenn dabei als
   letzte die =:else=-Zeile übrig bleibt, gilt:

   #+BEGIN_VERSE
       (cond
           :else exp)
       = exp
           
   #+END_VERSE

   D.h. der Wert des ganzen =cond=-Ausdrucks ist die Antwort hinter
   =:else=.

Bei der Auswertung von Ausdrücken beachte man folgende Daumen-

*Regel für die Auswertung von Ausdrücken:*

*Vereinfache immer den äußersten und am weitesten links stehenden
Teilausdruck, der ausgewertet werden kann.*

* Korrektheit rekursiver Funktionen

** Beweistechniken für Programme

-  Voraussetzungen:
   -  Formalisierung der Spezifikation eines Programms
   -  Formale Definition der Semantik der Programmiersprache
-  Funktionale (zustandslose) Programmierung:
   -  Semantik definiert durch Substitutionsmodell (s. o.)
   -  Beweise durch vollständige Induktion über die Rekursionstiefe
-  Prozedurale (objektorientierte) Programmierung:
   -  Semantik häufig axiomatisch definiert: Für jedes Sprachkonstrukt
      wird angegeben, was nach Ausführung gilt (Nachbedingung,
      post-condition), wenn vorher eine Vorbedingung (pre-condition)
      erfüllt war.

#+REVEAL: split

   -  Hoare-Kalkül: Axiome und Ableitungsregeln für alle Konstrukte
      einer einfachen imperativen Programmiersprache
   -  wp-Kalkül: Die Überprüfung der Korrektheit durch Rückwärtsanalyse
      des Programmcodes. Ausgehend von der Nachbedingung wird geprüft,
      ob diese durch die Vorbedingung und den Programmcode garantiert
      wird (wp = weakest precondition).

