Vorlesung/ProPar-FuProFormlttn.html

<div id="outline-container-org4f9216e" class="outline-3">
<h3 id="org4f9216e">Die globale Umgebung</h3>
<div class="outline-text-3" id="text-org4f9216e">
<ul class="org-ul">
<li>Man beachte, dass Ausdrücke wie<br />
<code>(+ x 2)</code> oder <code>(f 7 8)</code><br />
&#x2013; jeweils isoliert betrachtet &#x2013; nicht ausgewertet werden können, da
nicht klar ist, wozu <code>x</code> bzw. welche Funktion <code>f</code> ausgewertet werden
soll.</li>
<li>Die Auswertung ist nur in einer <i>Umgebung</i> möglich, in der die Werte
aller Variablen definiert sind.</li>
<li>Durch die Pseudofunktion <code>def</code> wird einer Variablen ein Wert
zugeordnet. Diese Assoziation merkt sich der Interpreter in einem
Gedächtnis, das <i>globale Umgebung</i> genannt wird.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf788dd2" class="outline-3">
<h3 id="orgf788dd2">Auswertungen in der globalen Umgebung</h3>
<div class="outline-text-3" id="text-orgf788dd2">
<ul class="org-ul">
<li>In einer Umgebung können nun auch Ausdrücke ausgewertet werden, die
Variablen enthalten, sofern sich für sie ein Eintrag in der Umgebung
befindet.</li>
<li>Dabei werden Variablen durch die ihnen assoziierten Werte ersetzt.</li>
<li>Für den Fall, dass die anzuwendende Funktion eine benutzerdefinierte
ist (d.h. der Variablen ist ein <code>fn</code>-Ausdruck zugeordnet), erweitern
wir die Auswertungsregel um das</li>
</ul>

<p>
<b>Ersetzungsmodell für Funktionsanwendungen:</b>
</p>

<ul class="org-ul">
<li><b>Werte den Rumpf der Funktion aus, wobei jeder formale Parameter
durch das korrespondierende ausgewertete Argument ersetzt wird.</b></li>

<li>Formal: Mit <code>(def f (fn</code> \([x_{1} \ldots x_{n}]\) <code>exp))</code> gilt:
\((f v_{1} \ldots v_{n}) = exp^{x_{i}}_{v_{i}}\). Dabei bedeutet
\(exp^{x_{i}}_{v_{i}}\), dass in <code>exp</code> jedes Auftreten eines \(x_{i}\) in
durch \(v_{i}\) ersetzt ist.</li>
</ul>
</div>
</div>

<div id="outline-container-org45feefd" class="outline-3">
<h3 id="org45feefd">Anwendung des Ersetzungsmodells</h3>
<div class="outline-text-3" id="text-org45feefd">
<ul class="org-ul">
<li>Gegeben seien die beiden folgenden Funktionsdefinitionen:</li>
</ul>
<div class="small">
<div class="org-src-container">
<pre class="src src-clojure">       <span style="color: #707183;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">summe-der-quadrate</span>
             <span style="color: #7388D6;">(</span><span style="color: #0000FF;">fn</span> <span style="color: #909183;">[</span>x y<span style="color: #909183;">]</span> 
               <span style="color: #909183;">(</span>+ <span style="color: #709870;">(</span>* x x<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>* y y<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
       <span style="color: #707183;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">fun</span>
             <span style="color: #7388D6;">(</span><span style="color: #0000FF;">fn</span> <span style="color: #909183;">[</span>a<span style="color: #909183;">]</span> 
               <span style="color: #909183;">(</span>summe-der-quadrate <span style="color: #709870;">(</span>+ a 1<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>* a 2<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span> </pre>
</pre>
</div>

</div>
<ul class="org-ul">
<li><p>
Wenden wir nun das Ersetzungsmodell auf diese Funktionsanwendung an: 
</p>

<p>
<code>(fun 3)</code>
</p></li>
</ul>

<p class="verse">
(<b>fun</b> 3)<br />
&#xa0;&#xa0;&#xa0;&#xa0;= ((fn [a] (summe-der-quadrate (+ a 1) (* a 2))) 3)<br />
&#xa0;&#xa0;&#xa0;&#xa0;= <b>((fn [a] (summe-der-quadrate (+ a 1) ( * a 2))) 3)</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;= (summe-der-quadrate (+ 3 1) (* 3 2))<br />
&#xa0;&#xa0;&#xa0;&#xa0;= (summe-der-quadrate <b>(+ 3 1) ( * 3 2)</b>)<br />
&#xa0;&#xa0;&#xa0;&#xa0;= (summe-der-quadrate 4 6)<br />
&#xa0;&#xa0;&#xa0;&#xa0;= (<b>summe-der-quadrate</b> 4 6)<br />
&#xa0;&#xa0;&#xa0;&#xa0;= ((fn [x y] (+ (* x x) (* y y))) 4 6)<br />
&#xa0;&#xa0;&#xa0;&#xa0;= <b>((fn [x y] (+ ( * x x) ( * y y))) 4 6)</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;= (+ (* 4 4) (* 6 6))<br />
&#xa0;&#xa0;&#xa0;&#xa0;= (+ 16 36)<br />
&#xa0;&#xa0;&#xa0;&#xa0;= 52<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orge876699" class="outline-2">
<h2 id="orge876699">Auswertungsregeln für Clojure-Pseudofunktionen</h2>
<div class="outline-text-2" id="text-orge876699">
</div><div id="outline-container-orgeb36c6e" class="outline-3">
<h3 id="orgeb36c6e">Pseudofunktionen</h3>
<div class="outline-text-3" id="text-orgeb36c6e">
<ul class="org-ul">
<li><i>Pseudofunktionen</i> (in der Lisp-Terminologie auch <i>special forms</i>
genannt) heißen so, weil

<ul class="org-ul">
<li>für sie besondere Auswertungsregeln gelten und/oder</li>

<li>ihre Auswertung keinen Wert liefert.</li>
</ul></li>

<li>Bisher benutzte Pseudofunktionen:

<ul class="org-ul">
<li><code>def</code></li>

<li><code>fn</code></li>

<li><code>cond</code></li>

<li><code>:else</code></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org6942e42" class="outline-3">
<h3 id="org6942e42">Auswertungsregeln für <code>def</code> und <code>fn</code></h3>
<div class="outline-text-3" id="text-org6942e42">
<dl class="org-dl">
<dt><code>def</code></dt><dd>Der Ausdruck <code>(def var exp)</code> liefert keinen Wert, sondern
hat lediglich den Effekt, dass der Variablen <code>var</code> der Wert von <code>exp</code>
in der globalen Umgebung zugeordnet wird.</dd>

<dt><code>fn</code></dt><dd>Der Ausdruck <code>(fn [v1 … vn] exp)</code> liefert als Wert eine
(namenlose/anonyme) Funktion mit den formalen Parametern <code>v1 … vn</code>
und der Berechnungsvorschrift <code>exp</code>.</dd>
</dl>
</div>
</div>

<div id="outline-container-orgdbbc0a4" class="outline-3">
<h3 id="orgdbbc0a4">Auswertungsregel für <code>cond</code> ohne <code>:else</code></h3>
<div class="outline-text-3" id="text-orgdbbc0a4">
<p>
Zwei Fälle sind zu unterscheiden:
</p>
<ol class="org-ol">
<li><p>
Die erste Frage (Bedingung) ist <code>false</code>:
</p>
<p class="verse">
(cond<br />
&#xa0;&#xa0;&#xa0;&#xa0;false \(\ldots\)<br />
&#xa0;&#xa0;&#xa0;&#xa0;frage2 antwort2<br />
&#xa0;&#xa0;&#xa0;&#xa0;\(\ldots\))<br />
= (cond<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;frage2 antwort2<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;\(\ldots\))<br />
</p>
<p>
D.h. die erste Frage-Antwort-Kombination wird eliminiert.
</p></li>
</ol>

<ol class="org-ol">
<li value="2"><p>
Die erste Frage (Bedingung) ist <code>true</code>:
</p>

<p class="verse">
(cond<br />
&#xa0;&#xa0;&#xa0;&#xa0;true exp<br />
&#xa0;&#xa0;&#xa0;&#xa0;\(\ldots\))<br />
= exp<br />
</p>

<p>
D.h. der Wert des ganzen <code>cond</code>-Ausdrucks ist <code>exp</code>.
</p></li>
</ol>

<p>
Wenn keine Frage <code>true</code> liefert, ist das Resultat <code>nil</code>.
</p>
</div>
</div>

<div id="outline-container-org366446a" class="outline-3">
<h3 id="org366446a">Auswertungsregel für <code>cond</code> mit <code>:else</code></h3>
<div class="outline-text-3" id="text-org366446a">
<ul class="org-ul">
<li><p>
Die Auswertung erfolgt wie bei <code>cond</code> ohne <code>:else</code>. Wenn dabei als
letzte die <code>:else</code>-Zeile übrig bleibt, gilt:
</p>

<p class="verse">
(cond<br />
&#xa0;&#xa0;&#xa0;&#xa0;:else exp)<br />
= exp<br />
<br />
</p>

<p>
D.h. der Wert des ganzen <code>cond</code>-Ausdrucks ist die Antwort hinter
<code>:else</code>.
</p></li>
</ul>

<p>
Bei der Auswertung von Ausdrücken beachte man folgende Daumen-
</p>

<p>
<b>Regel für die Auswertung von Ausdrücken:</b>
</p>

<p>
<b>Vereinfache immer den äußersten und am weitesten links stehenden
Teilausdruck, der ausgewertet werden kann.</b>
</p>
</div>
</div>
</div>

<div id="outline-container-org739535a" class="outline-2">
<h2 id="org739535a">Korrektheit rekursiver Funktionen</h2>
<div class="outline-text-2" id="text-org739535a">
</div><div id="outline-container-org2beb05c" class="outline-3">
<h3 id="org2beb05c">Beweistechniken für Programme</h3>
<div class="outline-text-3" id="text-org2beb05c">
<ul class="org-ul">
<li>Voraussetzungen:
<ul class="org-ul">
<li>Formalisierung der Spezifikation eines Programms</li>
<li>Formale Definition der Semantik der Programmiersprache</li>
</ul></li>
<li>Funktionale (zustandslose) Programmierung:
<ul class="org-ul">
<li>Semantik definiert durch Substitutionsmodell (s. o.)</li>
<li>Beweise durch vollständige Induktion über die Rekursionstiefe</li>
</ul></li>
<li>Prozedurale (objektorientierte) Programmierung:
<ul class="org-ul">
<li>Semantik häufig axiomatisch definiert: Für jedes Sprachkonstrukt
wird angegeben, was nach Ausführung gilt (Nachbedingung,
post-condition), wenn vorher eine Vorbedingung (pre-condition)
erfüllt war.</li>
</ul></li>
</ul>

<ul class="org-ul">
<li>Hoare-Kalkül: Axiome und Ableitungsregeln für alle Konstrukte
einer einfachen imperativen Programmiersprache</li>
<li>wp-Kalkül: Die Überprüfung der Korrektheit durch Rückwärtsanalyse
des Programmcodes. Ausgehend von der Nachbedingung wird geprüft,
ob diese durch die Vorbedingung und den Programmcode garantiert
wird (wp = weakest precondition).</li>
</ul>
</div>
</div>
