Vorlesung/ProPar-FuProFormlttn.org
** Rekursive Induktion 
*Beweis mittels rekursiver Induktion:*

1. Formuliere die Behauptung, die für den Algorithmus gelten muss.
2. Zeige, dass die Behauptung für einen Aufruf mit Rekursionstiefe 0
   gilt.
3. Zeige, dass aus der Gültigkeit der Behauptung für Aufrufe mit
   Rekursionstiefe gleich $n$ die Gültigkeit der Behauptung für Aufrufe
   mit Rekursionstiefe $n+1$ folgt.

*Definition der Rekursionstiefe:*

#+BEGIN_QUOTE
  Findet beim Ausführen des Aufrufs kein rekursiver Aufruf statt, dann
  ist die Rekursionstiefe 0, und sonst ist sie um 1 größer als die
  größte Rekursionstiefe aller weiteren Aufrufe, die durch diesen Aufruf
  verursacht werden.
#+END_QUOTE

** Beispiel: Funktion =len=

#+begin_small
#+BEGIN_SRC clojure
    ;; berechnet die Laenge einer Liste
    (def len
      (fn [lst]
        (cond
          (empty? lst) 0
          :else (+ 1 (len (rest lst))))))
        
#+END_SRC
#+end_small

-  Behauptung: :: Der Aufruf

   $$(len\ '(e_{1}\ e_{2}\ \ldots\ e_{n}))$$

   liefert die Anzahl $n$ der Elemente der als Argument übergebenen
   Liste.

** Beispiel: Funktion =len= (2)

-  Verankerung: :: Der Aufruf =(len ’())= liefert nach Ersetzungsmodell:

   #+begin_small
   #+BEGIN_SRC clojure
       (len '())
               = (cond
                     (empty? '()) 0
                     :else (+ 1 (len (rest '()))))
               = (cond
                     true 0
                     :else (+ 1 (len (rest '()))))
               = 0
           
   #+END_SRC
   #+end_small

   Wenn die Rekursionstiefe $k=0$ ist, liefert die Funktion $0$, d.h.
   die Länge der leeren Liste.

-  Induktionsannahme: :: Die Behauptung gilt für Rekursionstiefe
   $k = m$.

** Beispiel: Funktion =len= (3)

-  Induktionsschluss :: Wir betrachten jetzt den Aufruf

   $$(len\ '(e_{1}\ e_{2}\ \ldots\ e_{m+1}))$$

   Dieser Aufruf wird gemäß Ersetzungmodell ausgewertet als
   
\begin{eqnarray}
   (len\ ’(e_{1}\ e_{2}\ \ldots\ e_{m+1})) & = & (\mbox{cond}\\
    & &  (empty?\ ’(e_{1}\ e_{2}\ \ldots\ e_{m+1}))\ 0\\
    & &  \mbox{:else}\ (+ 1 (len\ (rest\ ’(e_{1}\ e_{2}\ldots\ e_{m+1})))))\\
    & = & (\mbox{cond}\\
    &  &     false\ 0\\
    &  &     \mbox{:else}\ (+\ 1\ (len (rest\ ’(e_{1}\ e_{2}\ \ldots\ e_{m+1})))))\\
    & = & (+\ 1\ (len (rest\ ’(e_{1}\ e_{2}\ \ldots\ e_{m+1}))))\\
    & = & (+\ 1\ (len\ ’(e_{2}\ \ldots\ e_{m+1})))
\end{eqnarray}

#+REVEAL: split
   Der Aufruf $$(len ’(e_{2}\ \ldots\ e_{m+1}))$$ besitzt die
   Rekursionstiefe $m$ und liefert gemäß Induktionsannahme $m$:
   $$(+ \ 1\ (len\ ’(e_{2}\ \ldots\ e_{m+1}))) = (+ \ 1\ m) = m+1$$

* Zusammenfassung

** Abstraktion durch Formalisierung ... 
... bedeutet:

-  Übergang von der Einzelfallbetrachtung (Stichproben, Tests) zu
   allgemein gültigen Aussagen

-  Abstraktion durch formalisierte Spezifikation:

   -  präzise Aussagen über die Semantik einer Funktion

   -  Beweisbarkeit der Implementierung


