Vorlesung/ProPar-FuProFormlttn.html

<div id="outline-container-org6a0e039" class="outline-3">
<h3 id="org6a0e039">Rekursive Induktion</h3>
<div class="outline-text-3" id="text-org6a0e039">
<p>
<b>Beweis mittels rekursiver Induktion:</b>
</p>

<ol class="org-ol">
<li>Formuliere die Behauptung, die für den Algorithmus gelten muss.</li>
<li>Zeige, dass die Behauptung für einen Aufruf mit Rekursionstiefe 0
gilt.</li>
<li>Zeige, dass aus der Gültigkeit der Behauptung für Aufrufe mit
Rekursionstiefe gleich \(n\) die Gültigkeit der Behauptung für Aufrufe
mit Rekursionstiefe \(n+1\) folgt.</li>
</ol>

<p>
<b>Definition der Rekursionstiefe:</b>
</p>

<blockquote>
<p>
Findet beim Ausführen des Aufrufs kein rekursiver Aufruf statt, dann
ist die Rekursionstiefe 0, und sonst ist sie um 1 größer als die
größte Rekursionstiefe aller weiteren Aufrufe, die durch diesen Aufruf
verursacht werden.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgd544350" class="outline-3">
<h3 id="orgd544350">Beispiel: Funktion <code>len</code></h3>
<div class="outline-text-3" id="text-orgd544350">
<div class="small">
<div class="org-src-container">
<pre class="src src-clojure">    <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">berechnet die Laenge einer Liste</span>
    <span style="color: #707183;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">len</span>
      <span style="color: #7388D6;">(</span><span style="color: #0000FF;">fn</span> <span style="color: #909183;">[</span>lst<span style="color: #909183;">]</span>
        <span style="color: #909183;">(</span><span style="color: #0000FF;">cond</span>
          <span style="color: #709870;">(</span><span style="color: #006FE0;">empty?</span> lst<span style="color: #709870;">)</span> 0
          <span style="color: #D0372D;">:else</span> <span style="color: #709870;">(</span>+ 1 <span style="color: #907373;">(</span>len <span style="color: #6276BA;">(</span><span style="color: #006FE0;">rest</span> lst<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
        </pre>
</pre>
</div>

</div>

<dl class="org-dl">
<dt>Behauptung:</dt><dd><p>
Der Aufruf
</p>

<p>
\[(len\ '(e_{1}\ e_{2}\ \ldots\ e_{n}))\]
</p>

<p>
liefert die Anzahl \(n\) der Elemente der als Argument übergebenen
Liste.
</p></dd>
</dl>
</div>
</div>

<div id="outline-container-orgdf3b3a6" class="outline-3">
<h3 id="orgdf3b3a6">Beispiel: Funktion <code>len</code> (2)</h3>
<div class="outline-text-3" id="text-orgdf3b3a6">
<dl class="org-dl">
<dt>Verankerung:</dt><dd><p>
Der Aufruf <code>(len ’())</code> liefert nach Ersetzungsmodell:
</p>

<div class="small">
<div class="org-src-container">
<pre class="src src-clojure">       <span style="color: #707183;">(</span>len '<span style="color: #7388D6;">()</span><span style="color: #707183;">)</span>
               = <span style="color: #707183;">(</span><span style="color: #0000FF;">cond</span>
                     <span style="color: #7388D6;">(</span><span style="color: #006FE0;">empty?</span> '<span style="color: #909183;">()</span><span style="color: #7388D6;">)</span> 0
                     <span style="color: #D0372D;">:else</span> <span style="color: #7388D6;">(</span>+ 1 <span style="color: #909183;">(</span>len <span style="color: #709870;">(</span><span style="color: #006FE0;">rest</span> '<span style="color: #907373;">()</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
               = <span style="color: #707183;">(</span><span style="color: #0000FF;">cond</span>
                     <span style="color: #D0372D;">true</span> 0
                     <span style="color: #D0372D;">:else</span> <span style="color: #7388D6;">(</span>+ 1 <span style="color: #909183;">(</span>len <span style="color: #709870;">(</span><span style="color: #006FE0;">rest</span> '<span style="color: #907373;">()</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
               = 0
           </pre>
</pre>
</div>

</div>

<p>
Wenn die Rekursionstiefe \(k=0\) ist, liefert die Funktion \(0\), d.h.
die Länge der leeren Liste.
</p></dd>

<dt>Induktionsannahme:</dt><dd>Die Behauptung gilt für Rekursionstiefe
\(k = m\).</dd>
</dl>
</div>
</div>

<div id="outline-container-orga0a67f5" class="outline-3">
<h3 id="orga0a67f5">Beispiel: Funktion <code>len</code> (3)</h3>
<div class="outline-text-3" id="text-orga0a67f5">
<dl class="org-dl">
<dt>Induktionsschluss</dt><dd><p>
Wir betrachten jetzt den Aufruf
</p>

<p>
\[(len\ '(e_{1}\ e_{2}\ \ldots\ e_{m+1}))\]
</p>

<p>
Dieser Aufruf wird gemäß Ersetzungmodell ausgewertet als
</p></dd>
</dl>

\begin{eqnarray}
   (len\ ’(e_{1}\ e_{2}\ \ldots\ e_{m+1})) & = & (\mbox{cond}\\
    & &  (empty?\ ’(e_{1}\ e_{2}\ \ldots\ e_{m+1}))\ 0\\
    & &  \mbox{:else}\ (+ 1 (len\ (rest\ ’(e_{1}\ e_{2}\ldots\ e_{m+1})))))\\
    & = & (\mbox{cond}\\
    &  &     false\ 0\\
    &  &     \mbox{:else}\ (+\ 1\ (len (rest\ ’(e_{1}\ e_{2}\ \ldots\ e_{m+1})))))\\
    & = & (+\ 1\ (len (rest\ ’(e_{1}\ e_{2}\ \ldots\ e_{m+1}))))\\
    & = & (+\ 1\ (len\ ’(e_{2}\ \ldots\ e_{m+1})))
\end{eqnarray}

<p>
Der Aufruf \[(len ’(e_{2}\ \ldots\ e_{m+1}))\] besitzt die
Rekursionstiefe \(m\) und liefert gemäß Induktionsannahme \(m\):
\[(+ \ 1\ (len\ ’(e_{2}\ \ldots\ e_{m+1}))) = (+ \ 1\ m) = m+1\]
</p>
</div>
</div>
</div>

<div id="outline-container-org41b1cca" class="outline-2">
<h2 id="org41b1cca">Zusammenfassung</h2>
<div class="outline-text-2" id="text-org41b1cca">
</div><div id="outline-container-org74e434d" class="outline-3">
<h3 id="org74e434d">Abstraktion durch Formalisierung &#x2026;</h3>
<div class="outline-text-3" id="text-org74e434d">
<p>
&#x2026; bedeutet:
</p>

<ul class="org-ul">
<li>Übergang von der Einzelfallbetrachtung (Stichproben, Tests) zu
allgemein gültigen Aussagen</li>

<li>Abstraktion durch formalisierte Spezifikation:

<ul class="org-ul">
<li>präzise Aussagen über die Semantik einer Funktion</li>

<li>Beweisbarkeit der Implementierung</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Johannes Brauer</p>
<p class="date">Created: 2017-10-10 Tue 21:40</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>